app/Models/ModelPersediaan.php

    public function getData($id_persediaan = false)
    {
        if ($id_persediaan == false) {
            return $this->findAll();
        }
        return $this->where(['id_persediaan' => $id_persediaan])->first();
---
SELECT *
FROM `persediaan`
SELECT *
FROM `persediaan`
WHERE `id_persediaan` = '2'
 LIMIT 1