app/Models/ModelMeubellair.php

SELECT *
FROM `meubellair`
---
    public function getData($id = false)
    {
        if ($id == false) {
            return $this->findAll();