app/Models/ModelLaporanYangDibutuhkan.php

SELECT *
FROM `laporan_yang_dibutuhkan`
---
    public function getData($id = false)
    {
        if ($id == false) {
            return $this->findAll();