app/Models/ModelLaboratorium.php

    public function getData($id = false)
    {
        if ($id == false) {
            return $this->findAll();
        }
        return $this->where(['id_lab' => $id])->first();
---
SELECT *
FROM `laboratorium`
SELECT *
FROM `laboratorium`
WHERE `id_lab` = '12'
 LIMIT 1