app/Models/ModelTanahDanBangunan.php

    public function getData($id = false)
    {
        if ($id == false) {
            return $this->findAll();
---
SELECT *
FROM `tanah_dan_bangunan`