app/Models/ModelPeralatanDanMesin.php

SELECT *
FROM `peralatan_dan_mesin`
WHERE `id` = '6'
 LIMIT 1
---
    public function getData($id = false)
    {
        if ($id == false) {
            return $this->findAll();
        }
        return $this->where(['id' => $id])->first();