app/Models/ModelAsetLainnya.php

    public function getData($id = false)
    {
        if ($id == false) {
            return $this->findAll();
        }
        return $this->where(['id' => $id])->first();
---
SELECT *
FROM `aset_lainnya`
SELECT *
FROM `aset_lainnya`
WHERE `id` = '5'
 LIMIT 1